**** Prolog check
#+begin_src prolog :session :goal age([PughI, PughII, BarneyMcGrew, Cuthbert, Dibble, Grub])
:- use_module(library(clpfd)).

age(Vars) :-
    Vars = [PughI, PughII, BarneyMcGrew, Cuthbert, Dibble, Grub],
    (PughI #> 0, PughII #> 0, BarneyMcGrew #> 0, Cuthbert #> 0, Dibble #> 0, Grub #> 0),
    all_different(Vars),
    
    (PughII #< PughI, PughII #< Cuthbert, PughII #< Grub),
    (BarneyMcGrew #< PughI, BarneyMcGrew #< Cuthbert, BarneyMcGrew #< Grub),
    (Dibble #< PughI, Dibble #< Cuthbert, Dibble #< Grub),

    ((PughI #= 2 * PughII); (PughII #= 2 * PughI)),

    (Cuthbert #> PughI, Cuthbert #> PughII, Cuthbert #> BarneyMcGrew, Cuthbert #> Dibble),
    (Grub #> PughI, Grub #> PughII, Grub #> BarneyMcGrew, Grub #> Dibble),
    (Cuthbert + Grub #= 27),

    (Dibble is 11),

    (BarneyMcGrew #< PughI, BarneyMcGrew #< PughII, BarneyMcGrew #< Cuthbert, BarneyMcGrew #< Dibble, BarneyMcGrew #< Grub),
    (0 #= mod(BarneyMcGrew, 3)).
#+end_src

#+RESULTS:
| PughI              | =  | 12,     |           |     |         |
| PughII             | =  | 6,      |           |     |         |
| BarneyMcGrew       | =  | 3,      |           |     |         |
| Dibble             | =  | 11,     |           |     |         |
| Cuthbert           | in | 13..14, |           |     |         |
| all_different([12, | 6, | 3,      | Cuthbert, | 11, | Grub]), |
| Cuthbert+Grub#=27, |    |         |           |     |         |
| Grub               | in | 13..14. |           |     |         |

**** Prolog Puzzle
#+begin_src prolog :session :goal findall(X, alive(X), Solution)
cat(pugh_i).
cat(pugh_ii).
cat(barney_mcgrew).
cat(cuthbert).
cat(dibble).
cat(grub).

fur(pugh_i, ginger).
fur(pugh_ii, ginger).
fur(barney_mcgrew, black).
wearing(pugh_i, blue_jacket).
wearing(pugh_ii, pink_collar).
wearing(barney_mcgrew, green_bowtie).
wearing(cuthbert, yellow_and_blue_bonnet).
wearing(dibble, white_ruff).
wearing(grub, purple_beret).
one_eyed(pugh_ii).
smiling(pugh_i).

worn_on(pink_collar, neck).
worn_on(blue_jacket, body).
worn_on(green_bowtie, neck).
worn_on(yellow_and_blue_bonnet, head).
worn_on(white_ruff, neck).
worn_on(purple_beret, head).

primary_color(blue_jacket).
primary_color(yellow_and_blue_bonnet).

dead(X) :- murdered(_, X).
alive(X) :- \+ dead(X).

%% parent(X, Y).
%% brother(X, Y).
%% sister(X, Y).
%% siblings(X, Y) :- brother(X, Y); brother(Y, X); sister(X, Y); sister(Y, X).
%% related(X, Y) :- parent(X, Y); parent(Y, X); siblings(X, Y).

%% cats with the same colour fur are directly related
related(X, Y) :- fur(X, Z), fur(Y, Z).

%% cats collars are younger than cats without
younger(X, Y) :- wearing(X, Collar), wearing(Y, NotCollar), worn_on(Collar, neck), worn_on(NotCollar, Z), Z \== neck.

murdered(pugh_i, pugh_ii).

#+end_src

#+RESULTS:
: Solution = [].

**** Prolog Example Puzzle
#+begin_src prolog :session :goal votesFor([Cairo, London, Beijing, Moscow, Mumbai, Nairobi, Jakarta])
count([],_,0).
count([X,Y|Rest],[X,Y],N) :- count(Rest,[X,Y],N1), N is N1 + 1.
count([Z|Rest],[X,Y],N) :- Z \= X, count(Rest, [X,Y], N).

votesFor([Cairo, London, Beijing, Moscow, Mumbai, Nairobi, Jakarta]) :-
    permutation([Cairo, London, Beijing, Moscow, Mumbai, Nairobi, Jakarta],[4,2,2,1,1,0,0]),
    (Cairo \== Beijing),
    (Moscow = 4; Moscow = 0),
    (Cairo > Jakarta),
    count([Cairo, London, Beijing, Moscow, Mumbai, Nairobi, Jakarta], [0,2], 2),
    (Jakarta is (London-1); Jakarta is (Beijing-1)).
#+end_src

#+RESULTS:
| Cairo = 4         |              |   |
| London = Moscow   | Moscow = 0   |   |
| Beijing = Mumbai  | Mumbai = 2   |   |
| Nairobi = Jakarta | Jakarta = 1. |   |

